In [5]:
import pandas as pd

## 예제 3-2  연산자와 메소드 계산

In [6]:
college = pd.read_csv('../data/2017_college_tuition.csv',encoding='euc-kr')
college.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [7]:
college.shape

(196, 3)

In [8]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [9]:
college['평균등록금'] = college['평균등록금']*1000
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

In [10]:
(college['평균등록금'] + college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [12]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

## 예제 3-3  특정 자료형을 가지고 열을 구분하기

In [13]:
college.head(2)

       학교명 설립구분    평균등록금
0  강릉원주대학교  국공립  4262000
1    강원대학교  국공립  4116000

In [14]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

select_dtypes(include=[]) => 해당되는 dtype 의 열만 출력

In [15]:
college.select_dtypes(include=['int64']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

int, float 는 숫자 자료형인 number 로도 구분 가능

In [16]:
college.select_dtypes(include=['number']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [17]:
college.select_dtypes(include=['object']).head()

         학교명 설립구분
0    강릉원주대학교  국공립
1      강원대학교  국공립
2  경남과학기술대학교  국공립
3      경북대학교  국공립
4      경상대학교  국공립

## 예제 3-4 시리즈 내의 자료값 확인하기

In [18]:
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

value_counts() => 같은값끼리 카운트

In [19]:
college['평균등록금'].value_counts().head()

3424000    2
7161000    2
4262000    1
5967000    1
7913000    1
Name: 평균등록금, dtype: int64

normalize = True 인자를 넣어주면 퍼센트(빈도)로 반환

In [20]:
college['평균등록금'].value_counts(normalize = True).head()

3424000    0.010204
7161000    0.010204
4262000    0.005102
5967000    0.005102
7913000    0.005102
Name: 평균등록금, dtype: float64

In [21]:
college['설립구분'].value_counts().head()

사립     156
국공립     40
Name: 설립구분, dtype: int64

In [22]:
college['설립구분'].head()

0    국공립
1    국공립
2    국공립
3    국공립
4    국공립
Name: 설립구분, dtype: object

duplicated() => 중복되는 값부터 True로 반환

In [23]:
college['설립구분'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: 설립구분, dtype: bool

In [24]:
college['설립구분'].unique()

array(['국공립', '사립'], dtype=object)

## 예제 3-5 내부 구성 값이 크기 비교

nlargest() => 크기가 큰 값부터 정렬(내림차순)

In [25]:
college['평균등록금'].nlargest(5)

173    9004000
132    8824000
128    8649000
147    8526000
146    8499000
Name: 평균등록금, dtype: int64

In [27]:
college.nlargest(5,'평균등록금')

           학교명 설립구분    평균등록금
173  한국산업기술대학교   사립  9004000
132      연세대학교   사립  8824000
128      신한대학교   사립  8649000
147    이화여자대학교   사립  8526000
146      을지대학교   사립  8499000

nsmallest() => 크기가 작은 값부터 정렬(오름차순)

In [26]:
college['평균등록금'].nsmallest(5)

61           0
157    1760000
137    2000000
20     2390000
15     3024000
Name: 평균등록금, dtype: int64

In [28]:
college.nsmallest(5,'평균등록금')

          학교명 설립구분    평균등록금
61   광주가톨릭대학교   사립        0
157   중앙승가대학교   사립  1760000
137   영산선학대학교   사립  2000000
20    서울시립대학교  국공립  2390000
15    부산교육대학교  국공립  3024000